/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strdup.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: samatsum <samatsum@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/11/30 12:22:09 by samatsum          #+#    #+#             */
/*   Updated: 2026/06/03 09:55:43 by samatsum         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "utils/utils.h"

/* ************************************************************************** */
char*
	ft_strdup(char const* s1);

/* ************************************************************************** */
// 文字列を複製し、新しく割り当てられたメモリ領域を返す
char*
	ft_strdup(char const* s1)
{
	char*	str;
	size_t	i;

	if (!s1) {
		return (NULL);
	}
	i = 0;
	while (s1[i]) {
		i++;
	}
	str = (char*)malloc(sizeof(*str) * (i + 1));
	if (!str) {
		return (NULL);
	}
	i = 0;
	while (s1[i]) {
		str[i] = s1[i];
		i++;
	}
	str[i] = 0;
	return (str);
}
